---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures
source: html/7e0a8c39-c873-730e-6ffd-2fc6d6f71f3e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures

Failures about RebarShape.

## Syntax (C#)
```csharp
public static class RebarShapeFailures
```